In [1]:
!pip install MySQLdb

Collecting MySQLdb

  Could not find a version that satisfies the requirement MySQLdb (from versions: )
No matching distribution found for MySQLdb

In [2]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
import json
import requests
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

In [3]:
# Build query Url and List of Stocks ticker
# https://www.alphavantage.co/query?function=TIME_SERIES_DAILY_ADJUSTED&symbol=GOOGL&apikey=Y5AE5LOO06SXQ60H
api_url = "https://www.alphavantage.co/query?function=TIME_SERIES_DAILY_ADJUSTED&symbol="
api_key = "Y5AE5LOO06SXQ60H"

# List of Stocks ticker
tickers = ["AAPL","CTSH","FB","GOOGL","IBM","MCD","MSFT","TSLA"]
# tickers = ["GOOGL"]

In [4]:
# create and initialize list 
df_list = []
stock_symbol = []
stock_daily_details = []
stock_data = []

for ticker in tickers:
    try:
        url = api_url + ticker + "&apikey=" + api_key

        stock_details = requests.get(url).json()
        stock_symbol = stock_details["Meta Data"]["2. Symbol"]
        stock_daily_details = stock_details["Time Series (Daily)"]
#         print(stock_daily_details)

        # Save json data for each API call
        with open(f'assets/data/output_api_{ticker}.json', 'w') as outfile:
            json.dump(stock_daily_details, outfile)    

    # If an error is experienced, skip the ticker
    except:
        print("ticker not found. Skipping...")
        pass

ticker not found. Skipping...
ticker not found. Skipping...
ticker not found. Skipping...

### Reading the json file

In [5]:
df_CTSH_t = pd.read_json("assets/data/output_api_CTSH.json")
df_GOOGL_t = pd.read_json("assets/data/output_api_GOOGL.json")
df_MSFT_t = pd.read_json("assets/data/output_api_MSFT.json")
df_TSLA_t = pd.read_json("assets/data/output_api_TSLA.json")
df_AAPL_t = pd.read_json("assets/data/output_api_AAPL.json")
df_IBM_t = pd.read_json("assets/data/output_api_IBM.json")
df_FB_t = pd.read_json("assets/data/output_api_FB.json")
df_MCD_t = pd.read_json("assets/data/output_api_MCD.json")

### Cleaning datas for Cognizant

In [6]:
df_CTSH = df_CTSH_t.transpose()

In [7]:
# renaming a column
df_CTSH = df_CTSH.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_CTSH.head()

,open,high,low,close,adjusted close,volume,dividend amount,split coefficient
2019-06-04,61.03,61.54,58.870,61.10,61.10,7812764.0,0.0,1.0
2019-06-03,61.77,62.10,60.130,60.54,60.54,7308487.0,0.0,1.0
2019-05-31,61.73,62.33,61.730,61.93,61.93,5698594.0,0.0,1.0
2019-05-30,61.94,62.90,61.750,62.36,62.36,5059753.0,0.0,1.0
2019-05-29,61.83,62.17,61.545,61.88,61.88,4540544.0,0.0,1.0

In [8]:
df_CTSH_new = df_CTSH[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
df_CTSH_new.head()

,open,high,low,close,adjusted close,volume,dividend amount
2019-06-04,61.03,61.54,58.870,61.10,61.10,7812764.0,0.0
2019-06-03,61.77,62.10,60.130,60.54,60.54,7308487.0,0.0
2019-05-31,61.73,62.33,61.730,61.93,61.93,5698594.0,0.0
2019-05-30,61.94,62.90,61.750,62.36,62.36,5059753.0,0.0
2019-05-29,61.83,62.17,61.545,61.88,61.88,4540544.0,0.0

In [9]:
# change type to float
df_CTSH_new = df_CTSH_new.astype(float)

In [10]:
#  adding ticker column
df_CTSH_new ['tickers']= 'CTSH'

In [11]:
#reindexing 
df_CTSH_new = df_CTSH_new.reset_index()
df_CTSH_new.head()

,index,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,61.03,61.54,58.870,61.10,61.10,7812764.0,0.0,CTSH
1,2019-06-03,61.77,62.10,60.130,60.54,60.54,7308487.0,0.0,CTSH
2,2019-05-31,61.73,62.33,61.730,61.93,61.93,5698594.0,0.0,CTSH
3,2019-05-30,61.94,62.90,61.750,62.36,62.36,5059753.0,0.0,CTSH
4,2019-05-29,61.83,62.17,61.545,61.88,61.88,4540544.0,0.0,CTSH

In [12]:
# renaming a column
df_CTSH_new = df_CTSH_new.rename(columns={'index': 'dates'})

In [95]:
df_CTSH_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,61.03,61.54,58.870,61.10,61.10,7812764.0,0.0,CTSH
1,2019-06-03,61.77,62.10,60.130,60.54,60.54,7308487.0,0.0,CTSH
2,2019-05-31,61.73,62.33,61.730,61.93,61.93,5698594.0,0.0,CTSH
3,2019-05-30,61.94,62.90,61.750,62.36,62.36,5059753.0,0.0,CTSH
4,2019-05-29,61.83,62.17,61.545,61.88,61.88,4540544.0,0.0,CTSH

### Connect to local database and load converted DataFrame into database

In [96]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')

In [97]:
df_CTSH_new.to_sql(name='ctsh_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'ctsh_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [98]:
pd.read_sql_query('select * from CTSH_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,61.03,61.54,58.870,61.10,61.10,7812764.0,0.0,CTSH
1,2019-06-03,61.77,62.10,60.130,60.54,60.54,7308487.0,0.0,CTSH
2,2019-05-31,61.73,62.33,61.730,61.93,61.93,5698594.0,0.0,CTSH
3,2019-05-30,61.94,62.90,61.750,62.36,62.36,5059753.0,0.0,CTSH
4,2019-05-29,61.83,62.17,61.545,61.88,61.88,4540544.0,0.0,CTSH

### Cleaning datas for Apple

In [17]:
# transposing the dataframe
df_AAPL = df_AAPL_t.transpose()

In [18]:
# renaming a column
df_AAPL = df_AAPL.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_AAPL_new = df_AAPL[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_AAPL_new = df_AAPL_new.astype(float)
#  adding ticker column
df_AAPL_new ['tickers']= 'AAPL'

In [68]:
df_AAPL_new = df_AAPL_new.reset_index()
# renaming a column
df_AAPL_new = df_AAPL_new.rename(columns={'index': 'dates'})

In [72]:
df_AAPL_new.head()

,dates,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,0,2019-06-04,175.44,179.83,174.52,179.64,179.64,30877458.0,0.0,AAPL
1,1,2019-06-03,175.60,177.92,170.27,173.30,173.30,40396069.0,0.0,AAPL
2,2,2019-05-31,176.23,177.99,174.99,175.07,175.07,27043584.0,0.0,AAPL
3,3,2019-05-30,177.95,179.23,176.67,178.30,178.30,21218412.0,0.0,AAPL
4,4,2019-05-29,176.42,179.35,176.00,177.38,177.38,28481165.0,0.0,AAPL

### Connect to local database and load converted DataFrame into database

In [73]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_AAPL_new.to_sql(name='aapl_Stock', con=engine, if_exists = 'append', index=False)

In [74]:
pd.read_sql_query('select * from aapl_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,175.44,179.83,174.52,179.64,179.64,30877458.0,0.0,AAPL
1,2019-06-03,175.60,177.92,170.27,173.30,173.30,40396069.0,0.0,AAPL
2,2019-05-31,176.23,177.99,174.99,175.07,175.07,27043584.0,0.0,AAPL
3,2019-05-30,177.95,179.23,176.67,178.30,178.30,21218412.0,0.0,AAPL
4,2019-05-29,176.42,179.35,176.00,177.38,177.38,28481165.0,0.0,AAPL

### Cleaning datas for Google

In [26]:
# transposing the dataframe
df_GOOGL = df_GOOGL_t.transpose()

In [27]:
# renaming a column
df_GOOGL = df_GOOGL.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_GOOGL_new = df_GOOGL[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_GOOGL_new = df_GOOGL_new.astype(float)
#  adding ticker column
df_GOOGL_new ['tickers']= 'GOOGL'

In [28]:
df_GOOGL_new = df_GOOGL_new.reset_index()
# renaming a column
df_GOOGL_new = df_GOOGL_new.rename(columns={'index': 'dates'})

In [75]:
df_GOOGL_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,1044.49,1058.44,1036.03,1054.49,1054.49,3021179.0,0.0,GOOGL
1,2019-06-03,1066.93,1067.00,1027.03,1038.74,1038.74,4844480.0,0.0,GOOGL
2,2019-05-31,1105.64,1113.40,1103.35,1106.50,1106.50,1579481.0,0.0,GOOGL
3,2019-05-30,1120.15,1126.80,1115.90,1121.41,1121.41,904419.0,0.0,GOOGL
4,2019-05-29,1132.70,1135.00,1111.95,1119.94,1119.94,1811510.0,0.0,GOOGL

### Connect to local database and load converted DataFrame into database

In [76]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_GOOGL_new.to_sql(name='googl_Stock', con=engine, if_exists = 'append', index=False)

In [77]:
pd.read_sql_query('select * from googl_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,1044.49,1058.44,1036.03,1054.49,1054.49,3021179.0,0.0,GOOGL
1,2019-06-03,1066.93,1067.00,1027.03,1038.74,1038.74,4844480.0,0.0,GOOGL
2,2019-05-31,1105.64,1113.40,1103.35,1106.50,1106.50,1579481.0,0.0,GOOGL
3,2019-05-30,1120.15,1126.80,1115.90,1121.41,1121.41,904419.0,0.0,GOOGL
4,2019-05-29,1132.70,1135.00,1111.95,1119.94,1119.94,1811510.0,0.0,GOOGL

### Cleaning datas for Microsoft

In [78]:
# transposing the dataframe
df_MSFT = df_MSFT_t.transpose()

In [34]:
# renaming a column
df_MSFT = df_MSFT.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_MSFT_new = df_MSFT[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_MSFT_new = df_MSFT_new.astype(float)
#  adding ticker column
df_MSFT_new ['tickers']= 'MSFT'

In [35]:
df_MSFT_new = df_MSFT_new.reset_index()
# renaming a column
df_MSFT_new = df_MSFT_new.rename(columns={'index': 'dates'})

In [79]:
df_MSFT_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-05-31,124.23,124.615,123.32,123.68,123.68,26445980.0,0.0,MSFT
1,2019-05-30,125.26,125.760,124.78,125.73,125.73,16829613.0,0.0,MSFT
2,2019-05-29,125.38,125.390,124.04,124.94,124.94,22763140.0,0.0,MSFT
3,2019-05-28,126.98,128.000,126.05,126.16,126.16,23128359.0,0.0,MSFT
4,2019-05-24,126.91,127.415,125.97,126.24,126.24,14123358.0,0.0,MSFT

### Connect to local database and load converted DataFrame into database

In [80]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_MSFT_new.to_sql(name='msft_Stock', con=engine, if_exists = 'append', index=False)

In [81]:
pd.read_sql_query('select * from msft_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-05-31,124.23,124.615,123.32,123.68,123.68,26445980.0,0.0,MSFT
1,2019-05-30,125.26,125.760,124.78,125.73,125.73,16829613.0,0.0,MSFT
2,2019-05-29,125.38,125.390,124.04,124.94,124.94,22763140.0,0.0,MSFT
3,2019-05-28,126.98,128.000,126.05,126.16,126.16,23128359.0,0.0,MSFT
4,2019-05-24,126.91,127.415,125.97,126.24,126.24,14123358.0,0.0,MSFT

### Cleaning datas for TSLA

In [39]:
# transposing the dataframe
df_TSLA = df_TSLA_t.transpose()

In [40]:
# renaming a column
df_TSLA = df_TSLA.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_TSLA_new = df_TSLA[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_TSLA_new = df_TSLA_new.astype(float)
#  adding ticker column
df_TSLA_new ['tickers']= 'TSLA'

In [41]:
df_TSLA_new = df_TSLA_new.reset_index()
# renaming a column
df_TSLA_new = df_TSLA_new.rename(columns={'index': 'dates'})

In [82]:
df_TSLA_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-05-31,185.10,189.9204,184.1000,185.16,185.16,10393647.0,0.0,TSLA
1,2019-05-30,188.75,192.2550,187.0200,188.22,188.22,7926475.0,0.0,TSLA
2,2019-05-29,187.10,192.3900,185.0401,189.86,189.86,11968638.0,0.0,TSLA
3,2019-05-28,191.20,195.0000,187.8500,188.70,188.70,10312901.0,0.0,TSLA
4,2019-05-24,199.83,199.9800,188.7505,190.63,190.63,14136572.0,0.0,TSLA

### Connect to local database and load converted DataFrame into database

In [83]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_TSLA_new.to_sql(name='tsla_Stock', con=engine, if_exists = 'append', index=False)

In [84]:
pd.read_sql_query('select * from tsla_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-05-31,185.10,189.9204,184.1000,185.16,185.16,10393647.0,0.0,TSLA
1,2019-05-30,188.75,192.2550,187.0200,188.22,188.22,7926475.0,0.0,TSLA
2,2019-05-29,187.10,192.3900,185.0401,189.86,189.86,11968638.0,0.0,TSLA
3,2019-05-28,191.20,195.0000,187.8500,188.70,188.70,10312901.0,0.0,TSLA
4,2019-05-24,199.83,199.9800,188.7505,190.63,190.63,14136572.0,0.0,TSLA

### Cleaning datas for IBM

In [45]:
# transposing the dataframe
df_IBM = df_IBM_t.transpose()

In [46]:
# renaming a column
df_IBM = df_IBM.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_IBM_new = df_IBM[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_IBM_new = df_IBM_new.astype(float)
#  adding ticker column
df_IBM_new ['tickers']= 'IBM'

In [47]:
df_IBM_new = df_IBM_new.reset_index()
# renaming a column
df_IBM_new = df_IBM_new.rename(columns={'index': 'dates'})

In [85]:
df_IBM_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,129.56,132.74,129.085,132.69,132.69,3912596.0,0.0,IBM
1,2019-06-03,127.10,128.56,127.060,128.27,128.27,4267080.0,0.0,IBM
2,2019-05-31,128.44,128.44,126.850,126.99,126.99,3539343.0,0.0,IBM
3,2019-05-30,129.74,129.97,128.930,129.57,129.57,2741880.0,0.0,IBM
4,2019-05-29,130.00,130.28,128.320,129.69,129.69,3678978.0,0.0,IBM

### Connect to local database and load converted DataFrame into database

In [86]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_IBM_new.to_sql(name='ibm_Stock', con=engine, if_exists = 'append', index=False)

In [87]:
pd.read_sql_query('select * from ibm_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,129.56,132.74,129.085,132.69,132.69,3912596.0,0.0,IBM
1,2019-06-03,127.10,128.56,127.060,128.27,128.27,4267080.0,0.0,IBM
2,2019-05-31,128.44,128.44,126.850,126.99,126.99,3539343.0,0.0,IBM
3,2019-05-30,129.74,129.97,128.930,129.57,129.57,2741880.0,0.0,IBM
4,2019-05-29,130.00,130.28,128.320,129.69,129.69,3678978.0,0.0,IBM

### Cleaning datas for FB

In [51]:
# transposing the dataframe
df_FB = df_FB_t.transpose()

In [52]:
# renaming a column
df_FB = df_FB.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_FB_new = df_FB[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_FB_new = df_FB_new.astype(float)
#  adding ticker column
df_FB_new ['tickers']= 'FB'

In [53]:
df_FB_new = df_FB_new.reset_index()
# renaming a column
df_FB_new = df_FB_new.rename(columns={'index': 'dates'})

In [88]:
df_FB_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,163.71,168.28,160.84,167.50,167.50,45995640.0,0.0,FB
1,2019-06-03,175.00,175.05,161.01,164.15,164.15,56059609.0,0.0,FB
2,2019-05-31,180.28,180.54,177.16,177.47,177.47,15226536.0,0.0,FB
3,2019-05-30,183.08,183.48,180.89,183.01,183.01,8581544.0,0.0,FB
4,2019-05-29,183.50,184.56,181.35,182.19,182.19,12797685.0,0.0,FB

### Connect to local database and load converted DataFrame into database

In [89]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_FB_new.to_sql(name='fb_Stock', con=engine, if_exists = 'append', index=False)

In [90]:
pd.read_sql_query('select * from fb_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-04,163.71,168.28,160.84,167.50,167.50,45995640.0,0.0,FB
1,2019-06-03,175.00,175.05,161.01,164.15,164.15,56059609.0,0.0,FB
2,2019-05-31,180.28,180.54,177.16,177.47,177.47,15226536.0,0.0,FB
3,2019-05-30,183.08,183.48,180.89,183.01,183.01,8581544.0,0.0,FB
4,2019-05-29,183.50,184.56,181.35,182.19,182.19,12797685.0,0.0,FB

### Cleaning datas for Mcdonald's Corp

In [57]:
# transposing the dataframe
df_MCD = df_MCD_t.transpose()

In [58]:
# renaming a column
df_MCD = df_MCD.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_MCD_new = df_MCD[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_MCD_new = df_MCD_new.astype(float)
#  adding ticker column
df_MCD_new ['tickers']= 'MCD'

In [59]:
df_MCD_new = df_MCD_new.reset_index()
# renaming a column
df_MCD_new = df_MCD_new.rename(columns={'index': 'dates'})

In [91]:
df_MCD_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-05-31,197.41,200.03,197.250,198.27,198.2700,3669137.0,1.16,MCD
1,2019-05-30,196.01,199.42,195.775,199.24,198.0811,2685006.0,0.00,MCD
2,2019-05-29,195.85,196.70,194.850,196.02,194.8798,2925087.0,0.00,MCD
3,2019-05-28,198.28,199.38,196.380,196.67,195.5261,3675164.0,0.00,MCD
4,2019-05-24,199.87,199.90,197.330,197.77,196.6197,2105755.0,0.00,MCD

### Connect to local database and load converted DataFrame into database

In [92]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_MCD_new.to_sql(name='mcd_Stock', con=engine, if_exists = 'append', index=False)

In [93]:
pd.read_sql_query('select * from mcd_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-05-31,197.41,200.03,197.250,198.27,198.2700,3669137.0,1.16,MCD
1,2019-05-30,196.01,199.42,195.775,199.24,198.0811,2685006.0,0.00,MCD
2,2019-05-29,195.85,196.70,194.850,196.02,194.8798,2925087.0,0.00,MCD
3,2019-05-28,198.28,199.38,196.380,196.67,195.5261,3675164.0,0.00,MCD
4,2019-05-24,199.87,199.90,197.330,197.77,196.6197,2105755.0,0.00,MCD

In [94]:
# Finally putting transformed dataframe to csv file
df_MCD_new.to_csv('Data/MCD_stock_details.csv',index = True, header = True)